import { Button } from '@components/atoms/button'
import { notify } from '@components/atoms/notify'
export function NotifPage() {
  return (
    <div>
      <Button
        mode={'main'}
        onClick={() => {
          notify.info({
            title: 'عنوان',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
          })
        }}
      >
        Info
      </Button>
      <Button
        mode={'main'}
        onClick={() => {
          notify.warning({
            title: 'عنوان',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
          })
        }}
      >
        Warning
      </Button>
      <Button
        mode={'main'}
        onClick={() => {
          notify.error({
            title: 'عنوان',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
          })
        }}
      >
        Error
      </Button>
      <Button
        mode={'main'}
        onClick={() => {
          notify.success({
            title: 'عنوان',
            text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
          })
        }}
      >
        Success
      </Button>
      <Button
        mode={'main'}
        onClick={() => {
          notify.promise({
            pendingMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            resolvedMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            rejectMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            promise: new Promise<void>((resolve) => {
              setTimeout(() => {
                resolve()
              }, 3000)
            })
          })
        }}
      >
        Promise Resolved
      </Button>
      <Button
        mode={'main'}
        onClick={() => {
          notify.promise({
            pendingMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            resolvedMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            rejectMessage: {
              title: 'عنوان',
              text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است.'
            },
            promise: new Promise<void>((_, reject) => {
              setTimeout(() => {
                reject()
              }, 3000)
            })
          })
        }}
      >
        Promise Rejected
      </Button>
    </div>
  )
}
